app/controllers/cadastros_controller.rb

  def index
    @cadastros = Cadastro.all
---
SELECT "cadastros".* FROM "cadastros"

  def create
    @cadastro = Cadastro.new(cadastro_params)

    respond_to do |format|
      if @cadastro.save
---
INSERT INTO "cadastros" ("name", "birthday_date", "email", "password", "confirm_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @cadastro.update(cadastro_params)
---
UPDATE "cadastros" SET "birthday_date" = ?, "updated_at" = ? WHERE "cadastros"."id" = ?  [["birthday_date", "2011-08-23"], ["updated_at", "2021-10-24 20:38:09.250041"], ["id", 1]]

    def set_cadastro
      @cadastro = Cadastro.find(params[:id])
---
SELECT "cadastros".* FROM "cadastros" WHERE "cadastros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]