app/controllers/homes_controller.rb

    def set_home
      @home = Home.find(params[:id])
---
SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]